SELECT * FROM [Дневник] 
WHERE [СтудНомер] = '1802016'

SELECT * FROM [Группы] 
WHERE [КодГруппы] = '1101'

SELECT * FROM [Дневник]
--WHERE ([СтудНомер] = '1802016')
--WHERE ([СтудНомер] = '1802016') AND ([Дата] >= '2020-02-10' AND [Дата] <= '2020-02-12')
--WHERE ([Дата] >= '2020-10-09 00:00:00.000' AND [Дата] <= '2020-12-10 00:00:00.000')
WHERE ([СтудНомер] = '1802016') AND ([Дата] BETWEEN convert(DATETIME, '04.11.2020', 102) AND convert(DATETIME, '03.12.2020', 102))

SELECT dbo.Дневник.СтудНомер, dbo.Студенты.ФИО_Студ, SUM(dbo.Дневник.ОтрабЧасы) AS ВсегоОтрабЧасов
FROM   dbo.Дневник INNER JOIN
             dbo.Студенты ON dbo.Дневник.СтудНомер = dbo.Студенты.СтудНомер
WHERE  (dbo.Студенты.КодГруппы = '1101') AND (([Дата] >= convert(DATETIME, '04.03.2020', 102)) AND ([Дата] <= convert(DATETIME, '04.10.2020', 102)))
GROUP BY dbo.Дневник.СтудНомер, dbo.Студенты.ФИО_Студ

SELECT dbo.Дневник.СтудНомер, dbo.Студенты.ФИО_Студ, SUM(dbo.Дневник.ОтрабЧасы) AS ВсегоОтрабЧасов
FROM   dbo.Дневник INNER JOIN
             dbo.Студенты ON dbo.Дневник.СтудНомер = dbo.Студенты.СтудНомер
WHERE dbo.Дневник.СтудНомер = '1802016'
GROUP BY dbo.Дневник.СтудНомер, dbo.Студенты.ФИО_Студ

SELECT [Студенческий номер], [ФИО Студента], [Всего отработано часов] 
FROM [Sum_HoursFull] 
WHERE ([Группа] = '18ПД-1')
AND ([Студенческий номер] = '1802016') AND ([Дата] >= convert(DATETIME, '04.03.2020', 102))


SELECT dbo.Sum_Hours.СтудНомер AS [Студенческий номер], dbo.Студенты.ФИО_Студ AS [ФИО Студента], 
dbo.Группы.Группа, dbo.Sum_Hours.ВсегоОтрабЧасов AS [Всего отработано часов], dbo.Преподаватели.ФИО_Препод, dbo.Дневник.Дата
FROM   dbo.Sum_Hours INNER JOIN
             dbo.Студенты ON dbo.Sum_Hours.СтудНомер = dbo.Студенты.СтудНомер INNER JOIN
             dbo.Группы ON dbo.Студенты.КодГруппы = dbo.Группы.КодГруппы INNER JOIN
             dbo.Преподаватели ON dbo.Группы.НомерПрепод = dbo.Преподаватели.НомерПрепод INNER JOIN
             dbo.Дневник ON dbo.Студенты.СтудНомер = dbo.Дневник.СтудНомер
WHERE ([Группа] = '18ПД-1')
AND (dbo.Sum_Hours.СтудНомер = '1802016') AND ([Дата] >= convert(DATETIME, '04.03.2020', 102))


SELECT dbo.Дневник.СтудНомер AS [Студенческий номер], dbo.Студенты.ФИО_Студ AS [ФИО Студента], 
dbo.Группы.Группа, SUM(Дневник.ОтрабЧасы) AS СуммаЧасов, dbo.Преподаватели.ФИО_Препод
FROM         dbo.Дневник INNER JOIN dbo.Студенты
      ON dbo.Студенты.СтудНомер = dbo.Дневник.СтудНомер INNER JOIN
             dbo.Группы ON dbo.Студенты.КодГруппы = dbo.Группы.КодГруппы INNER JOIN
             dbo.Преподаватели ON dbo.Группы.НомерПрепод = dbo.Преподаватели.НомерПрепод 
             
WHERE ([Группа] = '18ПД-1')
AND (Дневник.Дата >= convert(DATETIME, '04.03.2020', 102))
AND (Дневник.Дата >= convert(DATETIME, '06.03.2020', 102))
Group BY dbo.Дневник.СтудНомер, dbo.Студенты.ФИО_Студ, dbo.Группы.Группа,  dbo.Преподаватели.ФИО_Препод

EXEC GroupHours @Группа = '18ПД-1', @ДатаОт = '04.03.2020', @ДатаДо = '06.03.2020'